//============================================================
//
//	警告ヘッダー [warning.h]
//	Author：小原立暉
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _WARNING_H_
#define _WARNING_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "object3D.h"

//************************************************************
//	クラス定義
//************************************************************
// 警告クラス
class CWarning : public CObject3D
{
public:
	// コンストラクタ
	CWarning();

	// デストラクタ
	~CWarning() override;

	// オーバーライド関数
	HRESULT Init() override;	// 初期化
	void Uninit() override;		// 終了
	void Update(const float fDeltaTime) override;	// 更新
	void Draw(CShader* pShader = nullptr) override;	// 描画

	// 静的メンバ関数
	static CWarning* Create(const VECTOR3& rPos);

private:
	// メンバ変数
};

#endif	// _WARNING_H_
